Catalogs/узЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>узЗадачи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>b24_ПодразделениеИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.b24_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВнешнейЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>b24_ID</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаКомментария</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/узЗадачи/Ext/ObjectModule.bsl
&После("ПередЗаписью")
Процедура b24_ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка
		И ДополнительныеСвойства.Свойство("ЗадачаЗагруженаИзРасширенияИнтеграцияБитрикс24")
		И ДополнительныеСвойства.ЗадачаЗагруженаИзРасширенияИнтеграцияБитрикс24 = Истина Тогда
		
		Если ЭтоНовый()
			И НЕ ЗначениеЗаполнено(Родитель) Тогда
			ЭтоОсновнаяЗадача = Истина;
		Конецесли;
		
		Если НЕ ЭтоОсновнаяЗадача Тогда
			Проект = Неопределено;
		КонецЕсли;
		
		ОсновнаяЗадача = ПолучитьОсновнуюЗадачу(Родитель); 
		
		ЗаполнитьСтатусЗадачиЕслиОнНеЗаполнен(Отказ);
		
		СобытияВИстории = ОбновитьИсторию();
		
		ДополнительныеСвойства.Вставить("СобытияВИстории",СобытияВИстории);
		
		КоличествоЗадачЧекЛиста = ЭтотОбъект.Комментарии.Количество();
		КоличествоВыполненныхЗадачЧекЛиста = ЭтотОбъект.Комментарии.Итог("Выполнено");   
		                                                                                 		
	КонецЕсли;                                                                           
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда 
		
		ТаблицаКонтрагентов = РегистрыСведений.b24_ИдентификаторыОбъектов.ПолучитьТаблицуКонтрагентов(Исполнитель);
		
		Если ТаблицаКонтрагентов.Количество() > 0 Тогда 
			b24_ПодразделениеИсполнитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТаблицаКонтрагентов[0].Контрагент, "b24_Подразделение");
		КонецЕсли;
		
	ИначеЕсли ЭтоНовый()
		И ДополнительныеСвойства.Свойство("b24_ЭтоИнтерактивноеИзменение")
		И ДополнительныеСвойства.b24_ЭтоИнтерактивноеИзменение
		И Не ЗначениеЗаполнено(b24_ПодразделениеИсполнитель) Тогда 
		
		ТаблицаКонтрагентов = РегистрыСведений.b24_ИдентификаторыОбъектов.ПолучитьТаблицуКонтрагентов(Автор);
		
		Если ТаблицаКонтрагентов.Количество() > 0 Тогда 
			b24_ПодразделениеИсполнитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТаблицаКонтрагентов[0].Контрагент, "b24_Подразделение");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура b24_ПриЗаписи(Отказ)
	
	//фиксируем задачу для выгрузки
	b24_Интеграция.ЗаписатьОбъектВВыгружаемыеОбъекты(ЭтотОбъект, Отказ);
	
КонецПроцедуры
